# GetDocumentDefaultSketchStyle

## Description
Returns the document default sketch style.  Returns the string 'No Sketch' if the current sketch style is ?No Sketch?.

```pascal
FUNCTION GetDocumentDefaultSketchStyle : STRING;
```

```python
def vs.GetDocumentDefaultSketchStyle():
    return STRING
```

## Version
Availability: from VectorWorks11.5

## Category
* Document Attributes